docs/trait_selection_bug.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-May-14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Understanding a Trait Selection Bug</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Veera Sivarajan">
<link rel="stylesheet" type="text/css" href="./css/style.css"/>
</head>
<body>
<header id="top" class="status">
<nav>
  <a href="https://github.com/veera-sivarajan">GitHub</a>
  <a href="/">Home</a>
  <a href="/about/">About</a>
  <a href="mailto:sveera.2001@gmail.com">Email</a>
</nav>  
</header>
<main id="content">
<header>
<h1 class="title">Understanding a Trait Selection Bug</h1>
<p class="subtitle">2024-Apr-21</p>
</header><p>
Recently, I ran into <a href="https://github.com/rust-lang/rust/issues/24066">rust-lang/issues/#24066</a> and spent some time analysing the underlying trait selection mechanism. In this blog post, I&rsquo;ll briefly explain why this bug prevents the following snippet from compiling.
</p>

<div class="org-src-container">
<pre class="src src-rust">fn add&lt;T&gt;() where
    u32: std::ops::Add&lt;T, Output = T&gt;
{
    let _ = 1_u32 + 1_u32; // error[E0308]: mismatched types
}
</pre>
</div>

<p>
Inside the compiler, the <code>rustc_hir_typeck</code> crate handles lookup of methods for binary operations. When it encounters the expression <code>1_u32 + 1_u32</code>, it does something peculiar: instead of directly looking up for a method that adds an <code>u32</code> to another <code>u32</code>, it searches for a method that can add an <code>u32</code> to a type inference variable <code>$0</code>. This allows the compiler to either borrow or take ownership (refer to <a href="#org2423565">1</a>) of the value on the RHS of the binary expression based on the available methods<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>.
</p>

<p>
The request &ldquo;find a method to add an <code>u32</code> with the type inference variable <code>$0</code>&rdquo; is handled by the <code>rustc_trait_selection</code> crate, which selects an appropriate method from a collection of candidates. Here, traits specified in the where clause are given a higher precedence over other candidates<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>. I believe this heuristic is followed as the programmer is expected to specify only the necessary traits in the where clause.
</p>

<p>
Thus, for the expression <code>1_u32 + 1_u32</code>, a method which adds an <code>u32</code> and a type variable <code>T</code> is chosen because it&rsquo;s mentioned in the where clause and <code>T</code> unifies with the type inference variable <code>$0</code>. This attempts to unify the <code>u32</code> on the RHS with type variable <code>T</code>, resulting in a type mismatch error.
</p>

<p>
Guess, this is an other instance where a compiler leans towards soundness over completeness.
</p>
<section id="outline-container-orgc3a61dc" class="outline-2">
<h2 id="orgc3a61dc"><span class="section-number-2">1</span> <a id="org2423565"></a>Edit (May 14, 2024)</h2>
<div class="outline-text-2" id="text-1">
<p>
My understanding is incorrect. The real reason, as pointed by SkiFire13 on Reddit:
</p>
<blockquote>
<p>
Addition always takes ownership of the rhs. It may be a bit confusing because in case the rhs is a reference this means taking ownership of the reference, not the referenced value (because references are values as well!)
</p>

<p>
The reason the inference variable is used is due to coercions. If you&rsquo;re trying to sum a <code>String</code> with a <code>&amp;String</code> there&rsquo;s no impl that applies, so it would normally fail. However <code>&amp;String</code> coerces to <code>&amp;str</code>, for which there is an applicable impl. Using an inference variable allows to resolve the type of the rhs to <code>&amp;str</code> and then check that <code>&amp;String</code> coerces to <code>&amp;str</code>, instead of immediately erroring because there&rsquo;s no <code>impl Add&lt;&amp;String&gt;</code> for <code>String</code>. 
</p>
</blockquote>
</div>
</section>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara"><a href="https://github.com/rust-lang/rust/blob/0824b300eb0dae5d9ed59719d3f2732016683d66/compiler/rustc_hir_typeck/src/op.rs#L238-L254">https://github.com/rust-lang/rust/blob/0824b300eb0dae5d9ed59719d3f2732016683d66/compiler/rustc_hir_typeck/src/op.rs#L238-L254</a></p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara"><a href="https://doc.rust-lang.org/stable/nightly-rustc/rustc_middle/traits/select/enum.SelectionCandidate.html">https://doc.rust-lang.org/stable/nightly-rustc/rustc_middle/traits/select/enum.SelectionCandidate.html</a></p></div></div>


</div>
</div></main>
<footer id="postamble" class="status">
<div class='footer'>
  Last updated on 2024-May-14 Tue 17:49. <br>
</div>
</footer>
</body>
</html>
